In [3]:
# import library
import pandas as pd
import numpy as np
import os
print("pustaka berhasil dimuat")

pustaka berhasil dimuat

In [34]:
# buat jalur
folder = os.path.join("..", "data")
file = "Data_Training.csv"
path = os.path.join(folder, file)
print("jelaur universal berhasil dibuat", {path})

jelaur universal berhasil dibuat {'..\\data\\Data_Training.csv'}

In [35]:
# baca daca dari jalur yang sudah dibuat
df = pd.read_csv(path)
df.head(5)

,Periode,Bulan,Tidak/belum pernah sekolah,Tidak/belum tamat SD,SD,SLTP,SLTA Umum/SMU,SLTA Kejuruan/SMK,Akademi/Diploma,Universitas,Total
0,2006,Februari,234465,614960,2675459,2860007,2842876,1204140,297185,375601,11104693
1,2006,Agustus,170666,611254,2589699,2730045,2851518,1305190,278074,395554,10932000
2,2007,Februari,145750,520316,2753548,2643062,2630360,1114675,330316,409890,10547917
3,2007,Agustus,94301,438519,2179792,2264198,2532204,1538349,397191,566588,10011142
4,2008,Februari,79764,448431,2216748,2166619,2204377,1165582,519867,626202,9427590

In [36]:
# cek informasi dataset
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Periode                     35 non-null     int64
 1   Bulan                       35 non-null     object
 2   Tidak/belum pernah sekolah  35 non-null     int64
 3   Tidak/belum tamat SD        35 non-null     int64
 4   SD                          35 non-null     int64
 5   SLTP                        35 non-null     int64
 6   SLTA Umum/SMU               35 non-null     int64
 7   SLTA Kejuruan/SMK           35 non-null     int64
 8   Akademi/Diploma             35 non-null     int64
 9   Universitas                 35 non-null     int64
 10  Total                       35 non-null     int64
dtypes: int64(10), object(1)
memory usage: 3.1+ KB
None

In [37]:
df

,Periode,Bulan,Tidak/belum pernah sekolah,Tidak/belum tamat SD,SD,SLTP,SLTA Umum/SMU,SLTA Kejuruan/SMK,Akademi/Diploma,Universitas,Total
0,2006,Februari,234465,614960,2675459,2860007,2842876,1204140,297185,375601,11104693
1,2006,Agustus,170666,611254,2589699,2730045,2851518,1305190,278074,395554,10932000
2,2007,Februari,145750,520316,2753548,2643062,2630360,1114675,330316,409890,10547917
3,2007,Agustus,94301,438519,2179792,2264198,2532204,1538349,397191,566588,10011142
4,2008,Februari,79764,448431,2216748,2166619,2204377,1165582,519867,626202,9427590
5,2008,Agustus,103206,443832,2099968,1973986,2403394,1409128,362683,598318,9394515
6,2009,Februari,60347,415955,2143747,2054682,2133627,1337586,486399,626621,9258964
7,2009,Agustus,90471,547430,1531671,1770823,2472245,1407226,441100,701651,8962617
8,2010,Februari,59066,547164,1522465,1657452,2111256,1336881,538186,820020,8592490
9,2010,Agustus,157586,600221,1402858,1661449,2149123,1195192,443222,710128,8319779
10,2011,Februari,93956,559661,1291733,1834632,2385938,1109511,469009,635442,8379882
11,2011,Agustus,205388,737610,1241882,2138864,2376254,1161362,276816,543216,8681392
12,2012,Februari,126972,601753,1418683,1736670,2043697,1018465,258385,553206,7757831
13,2012,Agustus,85374,512041,1452047,1714776,1867755,1067009,200028,445836,7344866
14,2013,Februari,112435,523400,1421873,1821429,1874799,864649,197270,425042,7240897
15,2013,Agustus,81432,489152,1347555,1689643,1925660,1258201,185103,434185,7410931
16,2014,Februari,134040,610574,1374822,1693203,1893509,847365,195258,398298,7147069
17,2014,Agustus,74898,389550,1229652,1566838,1962786,1332521,193517,495143,7244905
18,2015,Februari,124303,603194,1320392,1650387,1762411,1174366,254312,565402,7454767
19,2015,Agustus,55554,371542,1004961,1373919,2280029,1569690,251541,653586,7560822
20,2016,Februari,94293,557418,1218954,1313815,1546699,1348327,249362,695304,7024172
21,2016,Agustus,59346,384069,1035731,1294483,1950626,1520549,219736,567235,7031775
22,2017,Februari,92331,546897,1292234,1281240,1552894,1383022,249705,606939,7005262
23,2017,Agustus,62984,404435,904561,1274417,1910829,1621402,242937,618758,7005262
24,2018,Februari,43740,452326,975661,1265421,1672601,1445340,304744,803624,6963457
25,2018,Agustus,32315,328781,908228,1142168,1945826,1752241,223456,740370,7073385
26,2019,Februari,36422,443495,965641,1235199,1690527,1397281,274377,855854,6898796
27,2019,Agustus,40771,347712,865778,1137195,2008035,1739625,218954,746354,7104424
28,2020,Februari,35761,346778,1006744,1251352,1748834,1443522,267583,824912,6925486
29,2020,Agustus,31379,428813,1410537,1621518,2662444,2326599,305261,981203,9767754
30,2021,Februari,20461,342734,1219494,1515089,2305093,2089137,254457,999543,8746008
31,2021,Agustus,23905,431329,1393492,1604448,2472859,2111338,216024,848657,9102052
32,2022,Februari,24852,437819,1230914,1460221,2251558,1876661,235359,884769,8402153
33,2022,Agustus,15206,663125,1274153,1500807,2478173,1661492,159490,673485,8425931
34,2022,Agustus,15206,663125,1274153,1500807,2478173,1661492,159490,673485,8425931

In [38]:
# buat kamus konversi manual bulan indo -> inggris
bulan_map = {
    'Januari': 'January',
    'Februari': 'February',
    'Maret': 'March',
    'April': 'April',
    'Mei': 'May',
    'Juni': 'June',
    'Juli': 'July',
    'Agustus': 'August',
    'September': 'September',
    'Oktober': 'October',
    'November': 'November',
    'Desember': 'December'
}
df["bulan"] = df["Bulan"].map(bulan_map)

df["gabungan"] = df["Periode"].astype(str) + ' ' + df["bulan"]

df["Waktu"] = pd.to_datetime(df["gabungan"], format="%Y %B", errors="coerce")

In [52]:
# hapus kolom" lama
#df = df.drop(columns=["Periode", "Bulan","bulan", "gabungan"])
df.head(5)

,Tidak/belum pernah sekolah,Tidak/belum tamat SD,SD,SLTP,SLTA Umum/SMU,SLTA Kejuruan/SMK,Akademi/Diploma,Universitas,Total,Waktu
0,234465,614960,2675459,2860007,2842876,1204140,297185,375601,11104693,2006-02-01
1,170666,611254,2589699,2730045,2851518,1305190,278074,395554,10932000,2006-08-01
2,145750,520316,2753548,2643062,2630360,1114675,330316,409890,10547917,2007-02-01
3,94301,438519,2179792,2264198,2532204,1538349,397191,566588,10011142,2007-08-01
4,79764,448431,2216748,2166619,2204377,1165582,519867,626202,9427590,2008-02-01

In [53]:
# cek hasil konversi
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Tidak/belum pernah sekolah  35 non-null     int64
 1   Tidak/belum tamat SD        35 non-null     int64
 2   SD                          35 non-null     int64
 3   SLTP                        35 non-null     int64
 4   SLTA Umum/SMU               35 non-null     int64
 5   SLTA Kejuruan/SMK           35 non-null     int64
 6   Akademi/Diploma             35 non-null     int64
 7   Universitas                 35 non-null     int64
 8   Total                       35 non-null     int64
 9   Waktu                       35 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(9)
memory usage: 2.9 KB

In [58]:
# simpan hasilnya konversi 
df.to_csv("Data_Preprocessing1.csv", index=False)

In [59]:
df = pd.read_csv("Data_Preprocessing1.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 10 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Tidak/belum pernah sekolah  35 non-null     int64
 1   Tidak/belum tamat SD        35 non-null     int64
 2   SD                          35 non-null     int64
 3   SLTP                        35 non-null     int64
 4   SLTA Umum/SMU               35 non-null     int64
 5   SLTA Kejuruan/SMK           35 non-null     int64
 6   Akademi/Diploma             35 non-null     int64
 7   Universitas                 35 non-null     int64
 8   Total                       35 non-null     int64
 9   Waktu                       35 non-null     object
dtypes: int64(9), object(1)
memory usage: 2.9+ KB